0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform 0.121;

boundaryField
{
    airfoilDown
    {
        type            omegaWallFunction;
        value           uniform 0.121;
    }
    airfoilUp
    {
        type            omegaWallFunction;
        value           uniform 0.121;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 0.121;
        value           uniform 0.121;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
