0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       pointVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    airfoilDown
    {
        type            fixedValue;
        value           $internalField;
        /*//value           uniform (0 0 0);
        type            angularOscillatingDisplacement;
        axis            (0 0 1);
        origin          (0.5 -0.1125 0);
        angle0          0;
        amplitude       #calc"degToRad(360)";
        omega           0.5; //6.28;
        value           uniform (0 0 0);*/
    }
    airfoilUp
    {
        type            fixedValue;
        value           $internalField;
        /*//value           uniform (0 0 0);
        type            angularOscillatingDisplacement;
        axis            (0 0 1);
        origin          (0.5 -0.1125 0);
        angle0          0;
        amplitude       #calc"degToRad(360)";
        omega           0.5; //6.28;
        value           uniform (0 0 0);*/
    }
    farfield
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
